/*!
 * Distpicker v1.0.4
 * https://github.com/fengyuanchen/distpicker
 *
 * Copyright (c) 2014-2016 Fengyuan Chen
 * Released under the MIT license
 *
 * Date: 2016-06-01T15:05:52.606Z
 */

(function (factory) {
  if (typeof define === 'function' && define.amd) {
    // AMD. Register as anonymous module.
    define('GoodsTypes', [], factory);
  } else {
    // Browser globals.
    factory();
  }
})(function () {

  var GoodsTypes ={86: {
    1: '酒水饮料',
    19: '正品香烟',
    30: '方便速食',
    57: '休闲零食',
    80: '水果蔬菜',
    91: '米面粮油',
    126: '乳品茶冲',
    147: '日用百货'
  },
  1: {
    2: '酒水',
    3: '饮料'
  },
  19: {
    20: '国产香烟',
    21: '进口香烟'
  },
  30: {
    31: '方便食品',
    32: '速冻食品',
    33: '火腿肠',
    34: '方便熟食',
    35: '罐头'
  },
  57: {
    58: '饼干糕点',
    59: '膨化食品',
    60: '坚果炒货',
    61: '果脯/果冻',
    62: '糖果类'
  },
  80: {
    81: '水果',
    82: '蔬菜'
  },
  91: {
    92: '主食',
    93: '五谷杂粮',
    94: '食用油',
    95: '调味品',
    96: '干货',
    97: '腊味'
  },
  126: {
    127: '乳制品',
    128: '茶叶类',
    129: '冲饮类',
    130: '冰激凌'
  },
  147: {
    148: '化妆品',
    149: '纸品卫生巾',
    150: '办公用品',
    151: '家用电器',
    152: '医药保健',
    153: '箱包皮具',
    154: '母婴用品',
    155: '包装',
    156: '家纺家饰',
    157: '运动户外',
    158: '数码电脑',
    159: '宠物用品'
  },
  2: {
    6: '啤酒',
    7: '白酒',
    8: '洋酒',
    9: '葡萄酒',
    10: '果酒',
    11: '清酒',
    12: '烧酒'
  },
  3: {
    13: '瓶装水',
    14: '桶装水',
    15: '果汁饮料',
    16: '果味饮料',
    17: '茶饮料',
    18: '酒味饮料'
  },
  20: {
    22: '烤烟型',
    23: '混合型',
    24: '雪茄型',
    25: '女士香烟'
  },
  21: {
    26: '烤烟型',
    27: '混合型',
    28: '雪茄型',
    29: '女士香烟'
  },
  31: {
    36: '方便面',
    37: '方便米粉',
    38: '方便米饭',
    39: '方便粥',
    40: '即冲汤料'
  },
  32: {
    41: '速冻水饺',
    42: '水产速冻食品',
    43: '农产速冻食品',
    44: '畜产速冻视频'
  },
  33: {
    45: '猪肉火腿肠',
    46: '鸡肉火腿肠',
    47: '牛肉火腿肠',
    48: '鱼肉火腿肠'
  },
  34: {
    49: '肉类熟食',
    50: '豆类熟食',
    51: '速食凉菜',
    52: '榨菜'
  },
  35: {
    53: '肉类罐头',
    54: '水果罐头',
    55: '蔬菜罐头',
    56: '清真罐头'
  },
  58: {
    63: '饼干',
    64: '进口饼干',
    65: '传统糕点',
    66: '西式糕点',
    67: '月饼'
  },
  59: {
    68: '薯片',
    69: '虾条',
    70: '爆米花',
    71: '雪饼/仙贝'
  },
  60: {
    72: '国产坚果',
    73: '进口坚果',
    74: '国产炒货',
    75: '进口炒货'
  },
  61: {
    76: '果脯',
    77: '果冻'
  },
  62: {
    78: '国产糖果',
    79: '进口糖果'
  },
  81: {
    83: '国产水果',
    84: '进口水果'
  },
  82: {
    85: '根菜类',
    86: '茎菜类',
    87: '叶菜类',
    88: '花菜类',
    89: '果菜类',
    90: '食用菌类'
  },
  92: {
    98: '国产大米',
    99: '泰国香米',
    100: '小米',
    101: '面粉',
    102: '黑米',
    103: '糯米',
    104: '面条'
  },
  93: {
    105: '豆类',
    106: '谷类',
    107: '杂粮'
  },
  94: {
    108: '豆油',
    109: '菜籽油',
    110: '花生油',
    111: '葵花籽油',
    112: '橄榄油',
    113: '茶油'
  },
  95: {
    114: '单味调味品',
    115: '基础调味品',
    116: '西式调味料',
    117: '烘培原料'
  },
  96: {
    118: '海产干活',
    119: '菌菇干货',
    120: '豆制品干货',
    121: '粉丝类干货'
  },
  97: {
    122: '腊肉',
    123: '腊肠',
    124: '熏肉',
    125: '清真腊味'
  },
  127: {
    131: '液体乳',
    132: '乳粉',
    133: '其他乳制品'
  },
  128: {
    134: '绿茶',
    135: '红茶',
    136: '乌龙茶',
    137: '花茶'
  },
  129: {
    138: '咖啡',
    139: '奶茶',
    140: '麦片',
    141: '芝麻糊',
    142: '功能保健',
    143: '减肥',
    144: '蜂产品'
  },
  130: {
    145: '软质冰激凌',
    146: '硬质冰激凌'
  }
};

  if (typeof window !== 'undefined') {
    window.GoodsTypes = GoodsTypes;
  }

  return GoodsTypes;

});
